apostolisrenesas/Motor_Control_Projects/RA6T3_MCILV1_SPM_LESS_FOC_E2S_V101/ra_gen/hal_data.c
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
  .p_shared_cfg = NULL,
#else
  .p_shared_cfg = &RA_NOT_DEFINED_extend_cfg,
#endif
#undef RA_NOT_DEFINED

        };

const motor_driver_cfg_t g_motor_driver0_cfg =
        {
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == g_adc0)
  .p_adc_instance = NULL,
#else
          .p_adc_instance = &g_adc0,
#endif
#undef RA_NOT_DEFINED
          .iu_ad_ch = (adc_channel_t) 0,
          .iv_ad_ch = (adc_channel_t) 1, .iw_ad_ch = (adc_channel_t) 2, .vdc_ad_ch = (adc_channel_t) 4, .sin_ad_ch =
                  (adc_channel_t) 16,
          .cos_ad_ch = (adc_channel_t) 6,
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
          .p_adc2_instance = NULL,
#else
  .p_adc2_instance = &RA_NOT_DEFINED,
#endif
#undef RA_NOT_DEFINED
          .shunt = MOTOR_DRIVER_SHUNT_TYPE_2_SHUNT,
          .p_three_phase_instance = &g_three_phase0, .p_callback = rm_motor_current_cyclic, .p_context =
                  &g_motor_current0,
          .p_extend = &g_motor_driver0_extend, };

/* Instance structure to use Motor Driver module. */
const motor_driver_instance_t g_motor_driver0 =
{ .p_ctrl = &g_motor_driver0_ctrl, .p_cfg = &g_motor_driver0_cfg, .p_api = &g_motor_driver_on_motor_driver, };
/* Motor Current Configuration */
motor_current_instance_ctrl_t g_motor_current0_ctrl;

motor_current_design_parameter_t g_motor_current0_design =
{ .f_current_omega = 300.0F, .f_current_zeta = 1.0F, };

motor_current_motor_parameter_t g_motor_current0_motor =
{ .u2_mtr_pp = 4,
  .f4_mtr_r = 0.4069514F,
  .f4_mtr_ld = 0.0004193683F,
  .f4_mtr_lq = 0.0004331033f,
  .f4_mtr_m = 0.0160805f,
  .f4_mtr_j = 0.00002887F, };

const motor_current_extended_cfg_t g_motor_current0_extend =
{ .f_comp_v[0] = 0.477F,
  .f_comp_v[1] = 0.742F,
  .f_comp_v[2] = 0.892F,
  .f_comp_v[3] = 0.979F,
  .f_comp_v[4] = 1.009F,
  .f_comp_i[0] = 0.021F,
  .f_comp_i[1] = 0.034F,
  .f_comp_i[2] = 0.064F,
  .f_comp_i[3] = 0.158F,
  .f_comp_i[4] = 0.400F,
  .vcomp_enable = MOTOR_CURRENT_VOLTAGE_COMPENSATION_SELECT_ENABLE,
  .f_current_ctrl_period = (0 + 1.0F) / 20.0F,
  .f_ilimit = 36.0F / 2.0F,
  .p_motor_parameter = &g_motor_current0_motor,
  .p_design_parameter = &g_motor_current0_design,
  .u1_control_type = MOTOR_CURRENT_CONTROL_TYPE_SENSORLESS,
  .shunt = MOTOR_CURRENT_SHUNT_TYPE_2_SHUNT,
  .u1_sample_delay_comp_enable = MOTOR_CURRENT_SAMPLE_DELAY_COMPENSATION_ENABLE,
  .f_period_magnitude_value = 1.5F, };

const motor_current_cfg_t g_motor_current0_cfg =
{ .p_motor_driver_instance = &g_motor_driver0, .p_motor_angle_instance = &g_motor_angle0, .p_callback =
          rm_motor_sensorless_current_callback,
  .p_context = &g_motor_sensorless0, .p_extend = &g_motor_current0_extend, };

/* Instance structure to use motor current control module. */
const motor_current_instance_t g_motor_current0 =
{ .p_ctrl = &g_motor_current0_ctrl, .p_cfg = &g_motor_current0_cfg, .p_api = &g_motor_current_on_motor_current, };
agt_instance_ctrl_t g_timer3_ctrl;
const agt_extended_cfg_t g_timer3_extend =
{ .count_source = AGT_CLOCK_PCLKB,
  .agto = AGT_PIN_CFG_DISABLED,
  .agtoab_settings_b.agtoa = AGT_PIN_CFG_DISABLED,
  .agtoab_settings_b.agtob = AGT_PIN_CFG_DISABLED,
  .measurement_mode = AGT_MEASURE_DISABLED,
  .agtio_filter = AGT_AGTIO_FILTER_NONE,
  .enable_pin = AGT_ENABLE_PIN_NOT_USED,
  .trigger_edge = AGT_TRIGGER_EDGE_RISING,
  .counter_bit_width = AGT_COUNTER_BIT_WIDTH_32, };
const timer_cfg_t g_timer3_cfg =
{ .mode = TIMER_MODE_PERIODIC,
/* Actual period: 0.0005 seconds. Actual duty: 50%. */.period_counts = (uint32_t) 0x61a8,
  .duty_cycle_counts = 0x30d4, .source_div = (timer_source_div_t) 0, .channel = 0, .p_callback = rm_motor_speed_cyclic,
  /** If NULL then do not add & */
#if defined(g_motor_speed0)
    .p_context           = g_motor_speed0,
#else
  .p_context = &g_motor_speed0,
#endif
  .p_extend = &g_timer3_extend,
  .cycle_end_ipl = (10),
#if defined(VECTOR_NUMBER_AGT0_INT)
    .cycle_end_irq       = VECTOR_NUMBER_AGT0_INT,
#else
  .cycle_end_irq = FSP_INVALID_VECTOR,
#endif
        };
/* Instance structure to use this module. */
const timer_instance_t g_timer3 =
{ .p_ctrl = &g_timer3_ctrl, .p_cfg = &g_timer3_cfg, .p_api = &g_timer_on_agt };
/* Motor Speed Configuration */
motor_speed_instance_ctrl_t g_motor_speed0_ctrl;

const motor_speed_extended_cfg_t g_motor_speed0_extend =
{ .f_speed_ctrl_period = 0.0005F,
  .f_limit_speed_change = 0.5F * 4,
  .f_max_speed_rad = 2400.0F * 4,
  .f_omega_t = 10.0F,
  .f_id_up_speed_rad = 400 * 4,
  .f_iq_limit = 1.67F,
  .f_ol_fb_speed_limit_rate = 0.20F,
  .f_natural_frequency = 100.0F,
  .u1_openloop_damping = MOTOR_SPEED_OPENLOOP_DAMPING_ENABLE,
  .u1_flux_weakening = MOTOR_SPEED_FLUX_WEAKEN_ENABLE,
  .u1_less_switch = MOTOR_SPEED_LESS_SWITCH_ENABLE,
  .u1_observer_swtich = MOTOR_SPEED_OBSERVER_SWITCH_ENABLE,
  .observer_select = MOTOR_SPEED_OBSERVER_SELECT_NORMAL,
  .u1_ctrl_method = MOTOR_SPEED_METHOD_PID,
  .ol_param.f4_ol_id_up_step = 0.3F / 256.0F,
  .ol_param.f4_ol_id_down_step = 0.3F / 50.0F,
  .ol_param.f4_ol_iq_down_step_ratio = 1.0F,
  .ol_param.f4_ol_id_ref = 0.3F,
  .ol_param.f4_id_down_speed_rad = 500 * 4,
  .ol_param.f4_id_up_speed_rad = 400 * 4,
  .ol_param.f4_opl2less_sw_time = 0.025F,
  .ol_param.f4_switch_phase_err_rad = 10,
  .ol_sub_param.f_damp_comp_gain = 0.0F,
  .ol_sub_param.f_fb_speed_limit_rate = 0.0F,
  .d_param.f_speed_omega = 3.0F,
  .d_param.f_speed_zeta = 1.0F,
  .d_param.f_ed_hpf_omega = 2.5F,
  .d_param.f_ol_damping_zeta = 1.0F,
  .d_param.f_phase_err_lpf_cut_freq = 10.0F,
  .d_param.f_observer_omega = 200.0F,
  .d_param.f_observer_zeta = 1.0F,
  .control_type = MOTOR_SPEED_CONTROL_TYPE_SENSORLESS,
  .mtr_param.u2_mtr_pp = 4,
  .mtr_param.f4_mtr_r = 0.4069514f,
  .mtr_param.f4_mtr_ld = 0.0004193683f,
  .mtr_param.f4_mtr_lq = 0.0004331033f,
  .mtr_param.f4_mtr_m = 0.0160805f,
  .mtr_param.f4_mtr_j = 0.00002887F, };

const motor_speed_cfg_t g_motor_speed0_cfg =
{ .st_input = &(g_motor_sensorless0_ctrl.st_speed_input),
  .st_output = &(g_motor_sensorless0_ctrl.st_speed_output),
  .p_callback = rm_motor_sensorless_speed_callback,
  .p_context = &g_motor_sensorless0,
  .p_timer_instance = &g_timer3,
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
  .p_position_instance = NULL,
#else
  .p_position_instance = &RA_NOT_DEFINED,
#endif
#undef RA_NOT_DEFINED
  .p_extend = &g_motor_speed0_extend, };

/* Instance structure to use motor speed module. */
const motor_speed_instance_t g_motor_speed0 =
{ .p_ctrl = &g_motor_speed0_ctrl, .p_cfg = &g_motor_speed0_cfg, .p_api = &g_motor_speed_on_motor_speed, };
/* Motor sensorless control configuration */
motor_sensorless_instance_ctrl_t g_motor_sensorless0_ctrl;

const motor_sensorless_extended_cfg_t g_motor_sensorless0_extend =
{ .f_overcurrent_limit = 1.67F * 1.414213562F * 1.5F,
  .f_overvoltage_limit = 60.0F,
  .f_overspeed_limit = 4500.0F,
  .f_lowvoltage_limit = 8.0F, };

const motor_cfg_t g_motor_sensorless0_cfg =
{ .p_callback = mtr_callback_event,
  .p_context = NULL,
  .p_motor_speed_instance = &g_motor_speed0,
  .p_motor_current_instance = &g_motor_current0,
  .p_extend = &g_motor_sensorless0_extend, };

/* Instance structure to use motor sensorless control module. */
const motor_instance_t g_motor_sensorless0 =
{ .p_ctrl = &g_motor_sensorless0_ctrl, .p_cfg = &g_motor_sensorless0_cfg, .p_api = &g_motor_on_sensorless, };
void g_hal_init(void)
{
    g_common_init ();
}
